export const detail = `
#### 【システム概要】

- リージョナルスーパーアプリ（RSA）のスタッフ側が触れる管理画面やQRコード読み込み後の画面などを開発する。

#### 【開発手法】

- 週1回進捗などの確認のためのミーティングを行う。
- 課題管理、開発のための設計書などをBacklogで行う。
- Backlogで管理されたチケットを単位にGitHub上でPull Requestを出しコードレビューを受けて随時改修する。

#### 【担当フェーズ】

- Vue.jsフロントエンドのとNode.js開発
- Node.js・ExpressJSによるバックエンドの開発
- セキュリティ上などの不具合の調査と改修とコードレビュー

#### 【担当業務】

- Nuxt.jsで作成されたQRコード読み込み時のフロントエンド画面または管理画面を開発・改修しました。
- Express.jsで作成されたバックエンドを開発しました。
- 実行時の不具合やセキュリティ上の不備の調査をし、改修の提案とPull Requestでレビューしつつ改善しました。
`;
